W4D4-master/app/controllers/notes_controller.rb

  def create
    note = Note.new(note_params)
    note.user_id = current_user.id
    if note.save
---
INSERT INTO "notes" ("user_id", "track_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["track_id", 1], ["body", "hello"]]

  def destroy
    note = Note.find(params[:id])
    if note && current_user.id == note.user_id
      track_id = note.track_id
      note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]